// 1.Импортируйте модуль `http`.
// 1.Создайте сервер с использованием метода `http.createServer()`. Этот метод принимает функцию обратного вызова, которая будет вызвана при каждом запросе к серверу.
// 1.В функции обратного вызова установите статус ответа. Для успешного ответа используйте статус код `200`.
// 1.Установите заголовок ответа `Content-Type`, который определяет тип содержимого. Для простого текстового ответа используйте значение `text/plain`.
// 1.Отправьте ответ с текстом `Hello, World!` и завершите обработку запроса.
// 1.Настройте сервер на прослушивание определенного порта. В данном случае используйте порт `3000`.
// 1.Добавьте сообщение в консоль, которое будет выводиться при успешном запуске сервера. Убедитесь, что оно включает адрес и порт, на котором работает сервер.
import http from 'http';


const PORT = process.env.PORT || 3000;

const server = http.createServer((req, res) => {
    res.statusCode = 200;
    res.setHeader('Content-Type', 'text/plain');
    res.end('Hello, world!');
});

server.listen(PORT, () => {
    console.log(`Server running at http://localhost:${PORT}`);
});







