// 1.Создайте новый файл для модуля. Откройте ваш редактор кода и создайте новый файл с именем `mathModule.js`.
// 1.Определите функции в модуле. В файле `mathModule.js` создайте две функции:
// ●`add(a, b)` - функция для сложения двух чисел.
// ●`subtract(a, b)` - функция для вычитания одного числа из другого.
// 1.Экспортируйте функции. Экспортируйте обе функции с помощью объекта `module.exports`.
// 1.Создайте основной файл проекта. Создайте новый файл с именем `app.js`.
// 1.Импортируйте ваш модуль. В начале файла `app.js` импортируйте ваш модуль `mathModule`.
// 1.Используйте функции модуля. В файле `app.js` используйте импортированные функции `add` и `subtract`, передайте им любые числа и выведите результаты в консоль.
// 1.Запустите ваш скрипт. В терминале перейдите в директорию с файлом `app.js` и выполните команду `node app.js` для запуска скрипта.
// =======================================================

// exports.add = (a, b) => a + b
const add = (a, b) => {
    return a + b
}

const substract = (a, b) => {
    return a - b
}

// module.exports = add
// module.exports = substract
module.exports = {
    add,
    substract
}